In [ ]:
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
arr=plt.imread(r"C:\Users\Anjali\OneDrive\Pictures\samm.jpg")

In [ ]:
sam_arr=arr.copy()
plt.imshow(sam_arr)
sam_arr.shape         #splits img

In [ ]:
x=np.random.randint(0,255,(50,50,3))
plt.imshow(x)

In [ ]:
while True:
    import numpy as np
    import matplotlib.pyplot as plt 
    import time
    x=np.random.randint(0,255,(10,10,3))
    plt.imshow(x)
    plt.show()
    time.sleep(0.5)
    display(clear=True)

In [ ]:
import numpy as np
import matplotlib.pyplot as plt 
a=np.random.randint(0,255,(4,4,3))
a

In [ ]:
final_arr=np.split(a,2)
len(final_arr)

In [ ]:
plt.imshow(a)

In [ ]:
plt.imshow(final_arr[1])

In [ ]:
plt.imshow(a)

In [ ]:
arr_1=np.split(a,2,axis=1)    # o horizontal and upper part   and 1 vertital and lower part

In [ ]:
len(arr_1)
a

In [ ]:
arr_1

In [ ]:
a.shape

In [ ]:
np.split(a,3,axis=2)

In [ ]:
a

In [ ]:
arr_2=np.split(a,3,axis=2)

In [ ]:
plt.imshow(a)       #a baki  arr_2 ke 0 1 2 se milkar ban rha hai

In [ ]:
len(arr_2)
plt.imshow(arr_2[0])

In [ ]:
plt.imshow(arr_2[1])

In [ ]:
plt.imshow(arr_2[2])

In [ ]:
len(arr_2)

In [ ]:
plt.imshow(np.split(arr,2,axis=0)[0])

In [ ]:
plt.imshow(np.split(arr,3,axis = 2)[2])

In [ ]:
arr.shape
# 936//3

In [ ]:

# plt.imshow(arr[:,:333,:])   if not divding through the no. of parts completly than do this
# if completly divided than do split
plt.imshow(arr[:,:312,:])

In [ ]:
#module....open cv it knows where is the subject here slicing and spliting gets done

In [ ]:
plt.imshow(np.split(arr,4,axis = 1)[3])    #last 3 means 3 parts me divide

In [ ]:
#where
a=np.random.randint(1,500,(4,4))
a

In [ ]:
np.where(a>200)     #it shows the index where the condn is true  and also where it's false
#np.where(a>200,'high sales','low sales') 
np.where(a>200,'high sales',a)

In [ ]:
np.clip(a,100,250)     #it will change the data out of range...ex-if <100...100 and 250< then 250 print
                        #it can be said as padding means changes acc to lower and upper outliers...removes & replace

Broadcasting
# it streches the arrays shape & dimension  to do element wise operation

In [ ]:
a=np.random.randint(1,10,7)
b=np.random.randint(1,10,(7,7))

print(a)
print('................\n\n')
print(b)

In [ ]:
# a+b    could not be broadcast together with shapes (7,) (2,2)...shape is row*col
#first checks shape then dimension
a+b

In [ ]:
a = np.random.randint(1,10,(7,1))
b = np.random.randint(1,10,(5,7))

print(a)
print('-------\n\n')
print(b)

In [ ]:
a*b   #if not broadcasting ..then error

In [ ]:
a = np.random.randint(1,10,(1,1))
b = np.random.randint(1,10,(5,7))

print(a)
print('-------\n\n')
print(b)

In [ ]:
a*b

In [ ]:
a = np.random.randint(1,10,(1,1,5))
b = np.random.randint(1,10,())

print(a)
print('-------\n\n')
print(b)

Pandas

In [ ]:
#introduction to python
#data= Explore...(Exploratory Data Analysis)
#EDA   ...can be performed in excel,sql,powerbi,python

In [ ]:
#pandas...is panel dataframe means in tabular form

In [2]:
import pandas as pd
pd.__version__

'2.2.3'

In [17]:
import numpy as np
import random

products=['chair','table','charger','phone','laptop']
region=['east','west','north','south']
all_date=pd.date_range('01-01-2025','23-07-2025')

data={'order_id':range(1,1001),
      'date':random.choices(all_date,k=1000),
      'region name':random.choices(region,k=1000),
      'product name':random.choices(region,k=1000),
      'sales':np.random.randint(100,1000,1000),
      'qty':np.random.randint(1,10,1000),
      'profit':np.random.randint(-10000,10000,1000)}
table=pd.DataFrame(data)
table

     order_id       date region name product name  sales  qty  profit
0           1 2025-04-18        west         east    179    8    4016
1           2 2025-01-05       north         west    989    5    6570
2           3 2025-07-02       north         east    422    9    4953
3           4 2025-06-25        west         east    626    3    4877
4           5 2025-03-06        east         west    741    9    6514
..        ...        ...         ...          ...    ...  ...     ...
995       996 2025-04-18        west         west    377    7   -6774
996       997 2025-01-07       south        north    467    2    5274
997       998 2025-02-14        west         west    235    2   -8677
998       999 2025-06-22        east         east    183    3    6138
999      1000 2025-02-24        west        south    747    7   -9196

[1000 rows x 7 columns]

In [18]:
# date column
# top data  # bydefault = 5
table.head()

   order_id       date region name product name  sales  qty  profit
0         1 2025-04-18        west         east    179    8    4016
1         2 2025-01-05       north         west    989    5    6570
2         3 2025-07-02       north         east    422    9    4953
3         4 2025-06-25        west         east    626    3    4877
4         5 2025-03-06        east         west    741    9    6514

In [ ]:

# table.head(10)  ..prints till 10 entries
table.info()             # infomation:- about dataset
table.sample()          #random 1 row will be printed

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      1000 non-null   int64
 1   date          1000 non-null   datetime64[ns]
 2   region name   1000 non-null   object
 3   product name  1000 non-null   object
 4   sales         1000 non-null   int32
 5   qty           1000 non-null   int32
 6   profit        1000 non-null   int32
dtypes: datetime64[ns](1), int32(3), int64(1), object(2)
memory usage: 43.1+ KB

     order_id       date region name product name  sales  qty  profit
400       401 2025-06-30       south         east    233    5   -5258

In [ ]:
# columns name

table.columns          #col and index are attributes so no brackets and while using method should use brackets
table.index

RangeIndex(start=0, stop=1000, step=1)

In [24]:
#none,null,nan,isnull...same
table.isnull().value_counts()

order_id  date   region name  product name  sales  qty    profit
False     False  False        False         False  False  False     1000
Name: count, dtype: int64